espressif/esp-adf/adf_examples/checks/esp_audio_analyzer_app/sdkconfig.defaults.esp32p4
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_AUDIO_ANALYZER_ENABLE_EMBED_FLASH=y
CONFIG_GMF_AUDIO_CODEC_DECODER_TYPE_FLAC=y
CONFIG_GMF_AUDIO_CODEC_ENCODER_TYPE_PCM=y
CONFIG_GMF_AI_AUDIO_AEC_CH_ALLOCATION="MR"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_CODEPAGE_936=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_LWIP_IRAM_OPTIMIZATION=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_WIFI_RMT_EXTRA_IRAM_OPT=n
CONFIG_WIFI_RMT_SLP_IRAM_OPT=n
